server/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? AND "users"."auth_token" = ? LIMIT ?  [["id", 1], ["auth_token", "1mxtYAr5GKsjc6GBV4eswZpW"], ["LIMIT", 1]]
---
  def authenticate(id, auth_token)
    User.find_by(id: id, auth_token: auth_token)