server/app/controllers/stocks_controller.rb

SELECT "stocks".* FROM "stocks" WHERE "stocks"."user_id" = ?  [["user_id", 1]]
---
  def consolidateStocks(userId)
    s = {}
    Stock.where(user_id: userId).collect do |stock|