server/app/controllers/stocks_controller.rb

INSERT INTO "stocks" ("name", "ticker", "quantity", "created_at", "updated_at", "user_id", "price") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Tesla, Inc."], ["ticker", "TSLA"], ["quantity", 1], ["created_at", "2020-02-17 20:29:12.618965"], ["updated_at", "2020-02-17 20:29:12.618965"], ["user_id", 1], ["price", 800.03]]
UPDATE "users" SET "balance" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["balance", 4199.97], ["updated_at", "2020-02-17 20:29:12.629405"], ["id", 1]]
---
  def buy
    user = authenticate(params[:id], request.headers["HTTP_AUTH_TOKEN"])
    if user
      begin
        Integer(params[:quantity])
      rescue ArgumentError
        render json: { success: false, error: "Quantity must be a positive integer"}
        return
      end

      res = HTTP.get("https://cloud.iexapis.com/stable/stock/#{params["ticker"]}/quote?token=#{ENV['IEX_KEY']}").to_s
      if res === "Unknown symbol" || res === "Not Found"
        render json: { success: false, error: res}
        return
      end
      data = JSON.parse(res)

      if user[:balance] < data["latestPrice"] * params["quantity"].to_i
        render json: { success: false, error: "Insufficient balance" }
      else
        Stock.create(name: data["companyName"], ticker: data["symbol"], price: data["latestPrice"], quantity: params["quantity"], user_id: user[:id])
        user[:balance] -= (data["latestPrice"] * params[:quantity].to_i)
        user.save

SELECT "stocks".* FROM "stocks" WHERE "stocks"."user_id" = ? ORDER BY created_at DESC  [["user_id", 1]]
---
  def transactions
    user = authenticate(params[:user_id], request.headers["HTTP_AUTH_TOKEN"])
    if user
      transactions = Stock.where(user_id: user.id).order("created_at DESC")

SELECT "stocks".* FROM "stocks" WHERE "stocks"."user_id" = ? ORDER BY created_at DESC  [["user_id", 1]]
---
  def consolidateStocks(userId)
    s = {}
    Stock.where(user_id: userId).each do |stock|