server/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "jeff@test.com"], ["LIMIT", 1]]
---
  def signin
    user = User.find_by(email: params[:email])

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "auth_token") VALUES (?, ?, ?, ?, ?, ?)
---
  def register
    user = User.new(name: params[:name], email: params[:email], password: params[:password])
    if user.valid?
      user.save